Repository: Pureminds-Media/Saudi_Exim_Global_partners_Forum_2025
Catalog: lib/l10n/app_*.arb
Languages: ar

# titleHome
source: Home
ar: الرئيسية

# titleServices
source: Support Services
ar: الخدمات الداعمة

# titleAgenda
source: Forum Agenda
ar: أجندة المنتدى

# titleMenu
source: Menu
ar: القائمة

# menuHeader
source: Menu
ar: القائمة

# menuAgenda
source: Forum Agenda
ar: الأجندة

# menuLocationDate
source: Venue
ar: الموقع

# menuAboutForum
source: About the Forum
ar: عن المنتدى

# menuWhoWeAre
source: Who We Are
ar: من نحن

# menuSupportServices
source: Nearby Services
ar: الخدمات المساعدة

# menuInspiringPartners
source: Inspiring Partnerships
ar: شراكات ملهمة

# menuForumCopies
source: Forum Editions
ar: إصدارات المنتدى

# menuNews
source: News
ar: الأخبار

# menuSaudi
source: Saudi Arabia
ar: المملكة العربية السعودية

# menuSpeakers
source: Speakers
ar: المتحدثين

# badgeNew10
source: +10 New
ar: +10 جديد

# navHome
source: Home
ar: الرئيسية

# navLocation
source: Venue
ar: الموقع

# navMenu
source: Menu
ar: القائمة

# agendaDayOne
source: Day One
ar: اليوم الاول

# agendaDayTwo
source: Day Two
ar: اليوم الثاني

# agendaDownload
source: Download
ar: تحميل

# agendaDownloadSuccess
source: Agenda for {day} ready to share.
ar: أصبحت أجندة {day} جاهزة للمشاركة.

# agendaDownloadFailed
source: Unable to generate the agenda PDF. Please try again.
ar: تعذر إنشاء ملف الأجندة. يرجى المحاولة مرة أخرى.

# agendaTime
source: Time
ar: الوقت

# agendaSessionTopics
source: Session Topics
ar: محاور الجلسة

# agendaDownloadComingSoon
source: Download link coming soon
ar: رابط التحميل سيتوفر قريبًا

# agendaTitle
source: Agenda
ar: الأجندة

# agendaDayOneHeading
source: Global Transitions and Opportunities in the Saudi Economy
ar: التحولات العالمية وفرص الاقتصاد السعودي

# agendaDayTwoHeading
source: Innovation and Finance in the Global South
ar: الابتكار والتمويل في الجنوب العالمي

# menuOverview
source: Overview
ar: عن المنتدى

# menuSponsorship
source: Sponsorship
ar: الرعايات

# sponsorTypeStrategic
source: Strategic Partner
ar: الشريك الإستراتيجي

# sponsorTypeDiamond
source: Diamond Partner
ar: الشريك الماسي

# sponsorTypeGold
source: Gold Partner
ar: الشريك الذهبي

# servicesNearby
source: Nearby Services
ar: الخدمات القريبة

# menuRegisterNow
source: Register Now
ar: سجل الآن

# cityAllSaudia
source: All Saudi Arabia
ar: كل السعودية

source: No services available
ar: لا توجد خدمات متاحة

# serviceInfoTitle
source: Service Information
ar: معلومات عن الخدمة

# websiteTitle
source: Website
ar: الموقع

# locationTitle
source: Venue
ar: الموقع

source: Not found
ar: غير موجود

source: Back
ar: رجوع

# cameraPermissionTitle
source: Camera access required
ar: السماح باستخدام الكاميرا

# cameraPermissionRationale
source: The registration portal may ask you to scan your badge or identification. Allow camera access so the official Saudi EXIM team can verify your credentials.
ar: قد تطلب منك بوابة التسجيل مسح الشارة أو الهوية. يرجى السماح بالوصول إلى الكاميرا حتى يتمكن فريق بنك التصدير والاستيراد السعودي من التحقق من بياناتك.

# cameraPermissionDenied
source: Camera access is required to continue registration.
ar: يتطلب إتمام التسجيل منح صلاحية الكاميرا.

# cameraPermissionSettings
source: Open Settings
ar: فتح الإعدادات

# cameraPermissionNotNow
source: Not now
ar: لاحقًا

# cameraPermissionLaunchFailed
source: We couldn't open the registration portal. Please try again.
ar: تعذر فتح بوابة التسجيل. يرجى المحاولة مرة أخرى.

source: Google Maps
ar: خرائط Google

source: Open Map
ar: فتح الخريطة

# noNetworkTitle
source: You're offline
ar: أنت غير متصل بالإنترنت

# noNetworkSubtitle
source: Check your connection to continue
ar: تحقق من الاتصال للمتابعة

# noNetworkDescription
source: We couldn't reach the forum servers. Please reconnect to Wiâ€‘Fi or mobile data and try again.
ar: تعذر الوصول إلى خوادم المنتدى. يرجى إعادة الاتصال بشبكة Wi-Fi أو بيانات الهاتف ثم المحاولة مجددًا.

# noNetworkRetry
source: Retry
ar: إعادة المحاولة
