import 'package:flutter/foundation.dart';

class AboutViewModel extends ChangeNotifier {
  final String aboutText =
      'المنتدى العالمي لشركاء بنك التصدير والاستيراد السعودي، منصة عالمية تجمع بين الرؤية الوطنية الطموحة والخبرة الدولية المتخصصة؛ لتصنع مساراً مستداماً للتجارة العالمية، من قلب المملكة إلى أسواق العالم، حيث يلتقي قادة الاقتصاد، وصناع السياسات، ورواد الاستثمار، في جلسات حوارية وورش عمل، تستشرف مستقبل التجارة وتمهّد لشراكات إستراتيجية تمتد عبر القارات.';
  final String missionVision =
      'منصة تجمع قادة الاقتصاد وصناع القرار عالميًا لاستشراف توجهات التجارة والاستثمار، وتطوير حلول مبتكرة في تمويل الصادرات، وتعزيز الشراكات الدولية لدعم تنويع الاقتصاد السعودي وتحقيق مستهدفات رؤية 2030';
  final String forumGoals =
      '1- تعزيز التعاون مع الشركاء المحليين والدوليين في قطاعات التصدير والاستيراد والاستثمار.  2- إتاحة الفرصة أمام الجهات المحلية والعالمية لمناقشة التحديات والفرص في مجال التجارة العالمية. 3-استعراض أحدث التطورات والابتكارات المتعلقة بتمويل الصادرات وخدمات الضمان';
  final String message =
      'تمكين الصادرات السعودية غير النفطية من الوصول للأسواق العالمية عبر الشراكات الاستراتيجية، واستشراف الفرص، وتبني الابتكار لتقليل المخاطر وتعزيز مكانة المملكة في التجارة العالمية';
  final String targetAudience =
      'الشركات السعودية، المستثمرون، الجهات الحكومية، والهيئات التمويلية المهتمة بالتجارة الدولية.';
  final String visionImage = 'assets/whoAreWe/vissionImage.png';
  final String messageImage = 'assets/whoAreWe/messageImage.png';
  final String goalsImage = 'assets/whoAreWe/goalsImage.png';
}
